'''
주어진 해가 윤년인지아닌지 계산하는 프로그램을 작성합니다.
일반적으로 1년은 365일이고, 윤년은 366일로 2월에 하루가 더 있음.

다음은 특정 연도가 윤년인지 확인하는 방법.
    1. 4로 나누어 떨어지는 해는 윤년.
    2. 그 중 100으로 나누어 떨어지는 해는 윤년이 아님
    3. 그 중 400으로 나누어떨어지는 해는 윤년임.

    이 3가지가 모두 만족해야 윤년.
'''

year = int(input("어느 해가 윤년인지 궁금한가요? >>>"))

if year%4 ==0 :
    print(f"{year}년은 윤년입니다.")

else :
    print(f"{year}년은 윤년이 아닙니다.")


============선생님답(중첩의문문)=============

if year%4 ==0 :
    if year % 400 ==0 :
        print("윤년입니다.")

    elif year % 100 == 0:
        print("윤년이 아닙니다.")

    else:
        print("윤년입니다.")

else:
    print("윤년이 아닙니다.")


==========논리연산자=============

if year %400 ==0 or (year%100 !=0 and year % 4 ==0):
    print("윤년입니다.")
else:
    print("윤년이 아닙니다.")

